<template>
  <div class="intro">
    <h2>游戏介绍</h2>
    <p>初链夺宝是一个完全公正、透明的去中心化DApp游戏，用户通过买入游戏号码，就有可能夺得最终游戏大奖。所有游戏交易均上链，可以通过区块浏览器查看所有详细记录。</p>
    <h3>规则说明</h3>
    <p>1.每购买1个号码只需要1个TGB，号码按购买顺序分配。</p>
    <p>2.每轮的游戏号码总数为N，则号码为1，2，....，N-1。</p>
    <p>3.每轮结束，区块高度增加7+后，合约有任意一笔入账交易，即向下取连续7个区块的区块哈希，将这7个区块哈希再联合取一次哈希，将哈希值转化为运算得出一个整数 X，X ∈ [0, N-1)。</p>
    <p>4.中奖号码为 X，号码为 X 的参与者即为中奖者。</p>
    <p>5.奖池的80%分配给中奖者；奖池的15%作为推广费用按比例分配给本期购买人的邀请人；5%分配为运营费用。</p>
    <p>6.邀请好友参与游戏，可获得邀请人下注金额15%的佣金奖励。</p>
    <p>7.整个过程由智能合约计算并自动完成派奖。</p>
    <p>本游戏解释权归游戏产品团队！</p>
    <h3>帮助介绍</h3>
    <p>1.TGB是什么？</p>
    <p>TGB用于在玩游中使用道具，价值等同于代币TREU，1TGB=1TRUE。</p>
    <p>2.为什么需要TGB？</p>
    <p>因使用ETH网络的代币进行游戏，将会产生高额的矿工费用和很慢的交易处理速度，严重影响用户的游戏体验；为了用户有很好的游戏体验，我们提供的TGB是运行在第三代区块链技术的初链网络中，既解决游戏中的交易处理速度问题，又可以让游戏公平、公正。用户在游戏里买入份额不会产生任何费用。</p>
    <p>3.如何兑换TGB？</p>
    <p>用户可用TRUE兑入为TGB，也可以反过来将TGB兑出为TRUE，兑换过程会产生ETH网络的矿工费，游戏平台不收取任何费用。</p>
  </div>
</template>

<script>
export default {
  name: 'Intro'
}
</script>

<style lang="stylus" scoped>
.intro
  font-size 14px
  margin 14px 16px 100px
h2
  text-align center
  font-size 18px
  font-weight 500
  margin 14px 0
h3
  font-size 16px
  font-weight 500
p
  margin 8px 0
</style>
